In [3]:
import numpy as np
import pandas as pd

In [5]:
def pregunta_01():
    """
    Carga de datos.
    -------------------------------------------------------------------------------------
    """
    # Lea el archivo `insurance.csv` y asignelo al DataFrame `df`
    df = pd.read_csv('insurance.csv')

    # Asigne la columna `charges` a la variable `y`.
    y = df['charges'].values

    # Asigne una copia del dataframe `df` a la variable `X`.
    X = df.copy()

    # Remueva la columna `charges` del DataFrame `X`.
    X.drop(['charges'],axis=1)

    # Retorne `X` y `y`
    return X, y

In [6]:
def pregunta_01():
    """
    Carga de datos.
    -------------------------------------------------------------------------------------
    """
    # Lea el archivo `insurance.csv` y asignelo al DataFrame `df`
    df = ____

    # Asigne la columna `charges` a la variable `y`.
    ____ = ____

    # Asigne una copia del dataframe `df` a la variable `X`.
    ____ = ____.____(____)

    # Remueva la columna `charges` del DataFrame `X`.
    ____.____(____)

    # Retorne `X` y `y`
    return X, y

In [22]:
 # Lea el archivo `insurance.csv` y asignelo al DataFrame `df`
df = pd.read_csv('insurance.csv')

In [23]:
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [24]:
# Asigne la columna `charges` a la variable `y`.
y = df['charges'].values

In [14]:
# Asigne una copia del dataframe `df` a la variable `X`.
X = df.copy()

In [31]:
# Remueva la columna `charges` del DataFrame `X`.
X.drop(['charges'],axis=1)

      age     sex     bmi  children smoker     region
0      19  female  27.900         0    yes  southwest
1      18    male  33.770         1     no  southeast
2      28    male  33.000         3     no  southeast
3      33    male  22.705         0     no  northwest
4      32    male  28.880         0     no  northwest
...   ...     ...     ...       ...    ...        ...
1333   50    male  30.970         3     no  northwest
1334   18  female  31.920         0     no  northeast
1335   18  female  36.850         0     no  southeast
1336   21  female  25.800         0     no  southwest
1337   61  female  29.070         0    yes  northwest

[1338 rows x 6 columns]

In [28]:
X.shape

(1338, 7)